<template>
  <div>
    <div class="useragreement">
      <div class="hellowwarp">
        <div class="heads">
          <div class="headauto">
            <div class="imgwarp" @click="imgwarpclick">
              <img src="../assets/back@2x.png" alt>
            </div>
            <div class="headtext">用户协议</div>
          </div>
        </div>

        <div class="concent">
          <div class="xieyi0">
            <h1>卡小福用户服务协议</h1>
            <div
              class="text"
            >南京酷克斯网络科技有限公司及其旗下分公司、子公司或关联公司（以下简称为"卡小福”）依据本协议的规定为用户提供服务，本协议在用户和卡小福之间具有合同法上的法律效力，卡小福在此特别提醒用户认真阅读、充分理解本协议各条款，特别是其中所涉及的免除及限制卡小福责任的条款、对用户的权利限制条款等。用户点击"同意并继续"按钮后，本协议即构成对双方有约束力的法律文件。</div>
          </div>
          <div class="xieyi0">
            <h1>第1条卡小福服务条款的确认和接纳</h1>
            <div
              class="text"
            >1.1卡小福的各项电子服务的所有权和运作权归卡小福所有。用户同意所有服务协议条款并完成注册程序，才能成为卡小福的正式用户。用户确认：本协议条款是处理双方权利义务的契约，始终有效，法律另有强制性规定或双方另有特别约定的，依其规定。</div>
            <div>1.2用户点击同意本协议的，即视为用户确认自己具有享受卡小福服务、下单购物等相应的权利能力和行为能力，能够独立承担法律责任。</div>
            <div>1.3卡小福保留在中华人民共和国大陆地区法施行之法律允许的范围内独自决定拒绝服务、关闭用户账户、清除或编辑内容或取消订单的权利。</div>
          </div>

          <div class="xieyi0">
            <h1>第2条卡小福服务</h1>
            <div class="text">2.1卡小福通过卡小福平台依法为用户提供互联网信息等服务，用户在完全同意本协议及卡小福平台规则的情况下，方有权使用卡小福的相关服务。</div>
            <div>2.2用户必须自行准备如下设备和承担如下开支：</div>
            <div>(1) 上网设备，包括并不限于电脑或者其他上网终端、调制解调器及其他必备的上网装置；</div>
            <div>(2) 上网开支，包括并不限于网络接入费、上网设备租用费、手机流量费等。</div>
          </div>

          <div class="xieyi0">
            <h1>第3条用户信息</h1>
            <div
              class="text"
            >3.1用户应自行向卡小福提供注册资料，用户所提供的注册资料应真实、准确、完整、合法有效，用户注册资料如有变动的，应及时更新注册资料。如果用户提供的注册资料不合法、不真实、不准确、不详尽的，用户需承担因此引起的相应责任及后果，并且卡小福保留终止用户使用卡小福平台各项服务的权利。</div>
            <div>3.2用户在卡小福平台进行浏览、下单购物等活动时，涉及用户真实姓名/名称、通信地址、联系电话、电子邮箱等隐私信息的，卡小福将予以严格保密，除非得到用户的授权或法律另有规定，卡小福不会向外界披露用户隐私信息。</div>
            <div>3.3用户注册成功后，将产生用户名和密码等账户信息，用户可以根据卡小福规定改变用户的密码。用户应谨慎合理的保存、使用其用户名和密码。用户若发现任何非法使用用户账号或存在安全漏洞的情況，请立即通知卡小福并向公安机关报案。</div>
            <div>3.4用户同意，卡小福拥有通过邮件、微信、短信、电话等形式，向用户或用户提供的收货人等发送订单信息、促销活动等告知信息的权利。</div>
            <div>3.5用户不得将在卡小福平台注册获得的账户借给他人使用，否则用户应承担由此产生的全部责任，并与实际使用人承担连带责任。</div>
            <div>3.6用户同意，卡小福有权使用用户的注册信息、名称、密码等信息，登陆进入用户的注册账户，进行证据保全，包括但不限于公证、见证等。</div>
          </div>

          <div class="xieyi0">
            <h1>第4条用户的依法言行义务</h1>
            <div class="text">本协议依据国家相关法律法规规章制定，用户同意严格遵守以下义务：</div>
            <div>(1) 不得传输或发表：煽动抗拒、破坏宪法和法律、行政法规实施的言论，煽动颠覆国家政权，推翻社会主义制度的言论，煽动分裂国家、破坏国家统一的言论，煽动民族仇恨、民族歧视、破坏民族团结的言论；</div>
            <div>(2) 从中国大陆向境外传输资料信息时必须符合中国有关法规；</div>
            <div>(3) 不得利用卡小福平台从事洗钱、窃取商业秘密、窃取个人信息等违法犯罪活动；</div>
            <div>(4) 不得干扰卡小福平台的正常运转，不得侵入卡小福平台系统；</div>
            <div>(5) 不得传输或发表任何违法犯罪的、骚扰性的、中伤他人的、辱骂性的、恐吓性的、伤害性的、庸俗的，淫秽的、不文明的等信息资料；</div>
            <div>(6) 不得传输或发表损害国家社会公共利益和涉及国家安全的信息资料或言论；</div>
            <div>(7) 不得教唆他人从事本条所禁止的行为；</div>
            <div>(8) 不得利用在卡小福平台注册的账户进行牟利性经营活动；</div>
            <div>(9) 不得发布任何侵犯他人著作权、商标权等知识产权或合法权利的内容；用户应不时关注并遵守卡小福不时公布或修改的各类合法规则规定。卡小福保有删除各类不符合法律政策或不真实的信息内容而无须通知用户的权利。若用户未遵守以上规定的，卡小福有权做出独立判断并采取暂停或关闭用户帐号等措施。用户须对自己在网上的言论和行为承担法律责任。</div>
          </div>

          <div class="xieyi0">
            <h1>第5条商品信息</h1>
            <div
              class="text"
            >卡小福平台上的商品价格、数量、是否有货等商品信息随吋都有可能发生变动，卡小福不作特别通知。由于卡小福平台上商品信息的数量极其庞大，虽然卡小福会尽最大努力保证用户所浏览商品信息的准确性，但由于众所周知的互联网技术因素等客观原因存在，卡小福平台显示的信息可能会有一定的滞后性或差错，对此情形用户知悉并理解；卡小福欢迎纠错，并会视情况给予纠错者一定的奖励。为表述便利，商品和服务简称为"商品"或"货物"。</div>
          </div>

          <div class="xieyi0">
            <h1>第6条订单</h1>
            <div
              class="text"
            >6.1在用户下订单时，请用户仔细确认卡小福平台上所购商品的名称、价格、数量、型号、规格、尺寸、联系地址、电话、收货人等信息。收货人与用户不一致的，收货人的行为和意思表示视为用户的行为和意思表示，用户应对收货人的行为及意思表示的法律后果承担连带责任。</div>
            <div>6.2除法律另有强制性规定外，双方约定如下：卡小福平台上销售方展示的商品和价格等信息仅仅是要约邀请，用户下单时须填写用户希望购买的商品数量、价款及支付方式、收货人、联系方式、收货地址（合同履行地点）、合同履行方式等内容；系统生成的订单信息是计算机信息系统根据用户填写的内容自动生成的数据，仅是用户向销售方发出的合同要约；销售方收到该订单信息后，已将货物实际直接向用户发出时，方视为用户与销售方之间就发出的货物建立了合同关系；如果用户在一份订单里订购了多种商品并且销售方只给用户发出了部分商品时，用户与销售方之间仅就实际向用户发出的商品建立了合同关系。</div>
            <div>6.3由于市场变化及各种以合理商业努力难以控制的因素的影响，卡小福无法保证用户提交的订单信息中希望购买的商品都会有货；如用户拟购买的商品，发生缺货，用户有权取消订单。</div>
          </div>

          <div class="xieyi0">
            <h1>第7条配送</h1>
            <div
              class="text"
            >7.1销售方将会把商品（货物）送到用户所指定的收货地址，所有在卡小福平台上列出的送货时间为参考时间，参考时间的计算是根据库存状况、正常的处理过程和送货时间、送货地点的基础上估计得出的。</div>
            <div>7.2因如下情况造成订单延迟或无法配送等，销售方不承担延迟配送的责任：</div>
            <div>(1) 用户提供的信息错误、地址不详细等原因导致的；</div>
            <div>(2) 货物送达后无人签收，导致无法配送或延迟配送的；</div>
            <div>(3) 情势变更因素导致的；</div>
            <div>(4) 不可抗力因素导致的，例如：自然灾害、交通戒严、突发战争等。</div>
          </div>

          <div class="xieyi0">
            <h1>第8条所有权及知识产权条款</h1>
            <div
              class="text"
            >8.1用户一旦接受本协议，即表明该用户主动将其在任何时间段在卡小福平台发表的任何形式的信息内容（包括但不限于客户评价、客户咨询、各类话题文章等信息内容）的财产性权利，如著作权财产权（包括并不限于：复制权、发行权、出租权、展览权、表演权、放映权、广播权、信息网络传播权、摄制权、改编权、翻译权、汇编权以及应当由著作权人享有的其他可转让权利），全部独家且不可撤销地转让给卡小福所有，用户同意卡小福有权就任何主体侵权而单独提起诉讼。</div>
            <div>8.2本协议已经构成《中华人民共和国著作权法》第二十五条（条文序号依照2011年版著作权法确定）及相关法律规定的著作财产权转让书面协议，其效力及于用户在卡小福平台上发布的任何受著作权法保护的作品内容，无论该等内容形成于本协议订立前还是本协议订立 后。</div>
            <div>8.3用户同意并已充分了解本协议的条款，承诺不将已发表于卡小福平台的信息，以任何形式发布或授权其它主体以任何方式使用（包括但限于在各类平台、媒体上使用）。</div>
            <div>8.4卡小福对卡小福平台内容及资源的著作权等合法权利,受国家法律保护，有权对本协议及卡小福平台内容进行修改，并在卡小福平台张贴，无须另行通知用户。在法律允许的最大限度范围内，卡小福对本协议及卡小福平台内容拥有解释权。</div>
            <div>8.5除法律另有强制性规定外，未经卡小福明确的书面许可，任何单位或个人不得以任何方式非法地全部或部分复制、转载、引用、链接、抓取或以其他方式使用卡小福平台的信息内容，否则，卡小福有权追究其法律责任。</div>
            <div>8.6卡小福平台所刊登的资料信息（诸如文字、图表、标识、按钮图标、图像、声音文件片段、数字下载、数据编辑和软件），均是卡小福或其内容提供者的财产，受中国和国际版权法的保护。卡小福平台上所有内容的汇编是卡小福的排他财产，受中国和国际版权法的保护。卡小福平台上所有软件都是卡小福或其软件供应商的财产，受中国和国际版权法的保护。</div>
          </div>

          <div class="xieyi0">
            <h1>第9条责任限制及不承诺担保</h1>
            <div
              class="text"
            >除非另有明确的书面说明，卡小福及其所包含的或以其它方式通过卡小福平台提供给用户的全部信息、内容、材料、产品（包括软件）和服务，均是在“按现状”和"按现有"的基础上提供的。除非另有明确的书面说明,卡小福不对卡小福平台的运营及其包含在卡小福平台上的信息、内容、材料、产品（包括软件）或服务作任何形式的、明示或默示的声明或担保（根据中华人民共和国法律另有规定的以外）。卡小福不担保卡小福平台所包含的或以其它方式通过卡小福平台提供给用户的全部信息、内容、材料、产品（包括软件）和服务、其服务器或从卡小福发出的电子信件、信息没有病毒或其他有害成分。如因不可抗力或其它卡小福无法控制的原因使卡小福平台系统崩溃或无法正常使用导致网上交易无法完成或丢失有关的信息、记录等，卡小福会合理地尽力协助处理善后事宜。</div>
          </div>

          <div class="xieyi0">
            <h1>第10条协议更新及用户关注义务</h1>
            <div
              class="text"
            >根据国家法律法规变化及卡小福平台运营需要，卡小福有权对本协议及用户与卡小福之间签订的其他协议条款不时地进行修改，修改后的协议一旦被张贴在卡小福平台上即生效，并代替原来的协议。用户可随时登陆查阅最新协议；用户有义务不时关注并阅读最新版的协议及平台公告。如用户不同意更新后的协议，可以且应立即停止接受卡小福平台依据本协议提供的服务；如用户继续使用卡小福平台提供的服务的，即视为同意更新后的协议。卡小福建议用户在使用卡小福平台之前阅读本协议及卡小福的公告。如果本协议中任何一条被视为废止、无效或因任何理由不可执行，该条应视为可分的且并不影响任何其余条款的有效性和可执行性。</div>
          </div>

          <div class="xieyi0">
            <h1>第11条法律管辖和适用</h1>
            <div
              class="text"
            >本协议的订立、执行和解释及争议的解决均应适用在中华人民共和国大陆地区适用之有效法律（但不包括其冲突法规则）。如发生本协议与适用之法律相抵触时，则这些条款将完全按法律规定重新解释，而其它有效条款继续有效。如缔约方就本协议内容或其执行发生任何争议，双方应尽力友好协商解决；协商不成时，任何一方均可向协议签约地人民法院提起诉讼。</div>
          </div>

          <div class="xieyi0">
            <h1>第12条个人征信信息查询</h1>
            <div class="text">12.1用户同意依法设立的征信机构向有关机构征集用户的信息，并出具《个人信用报告》。</div>
            <div>12.2用户同意卡小福有权通过依法设立的征信机构查询用户信息并获取用户《个人信用报告》，以了解用户信用状况。</div>
            <div>12.3用户同意，卡小福有权向依法设立的征信机构提供用户在卡小福平台所登记的个人信息等相关信息。</div>
            <div>12.4用户同意，拥有用户不良信息的机构有权通过依法设立的征信机构向卡小福提供用户的不良信息。</div>
            <div>12.5用户同意，卡小福有权向依法设立的征信机构提供用户在卡小福平台上因赊购服务或借贷申请所产生的个人信息、相关赊购信息、相关借贷信息及后续还款记录等信息。</div>
            <div>12.6用户同意，卡小福有权向依法设立的征信机构提供用户借贷的不良信息。用户事先已明确被告知并同意卡小福向依法设立的征信机构提供用户的不良信息。</div>
          </div>

          <div class="xieyi0">
            <h1>第13条其他</h1>
            <div class="text">13.1卡小福平台所有者是指在政府部门依法许可或备案的卡小福平台经营主体。</div>
            <div>13.2卡小福尊重用户的合法权利，本协议及卡小福平台上发布的各类规则、声明等其他内容，均是为了更好的、更加便利的为用户提供服务。卡小福欢迎用户提出意见和建议，卡小福将虚心接受并适时修改本协议及卡小福上的各类规则。</div>
            <div>13.3本协议内容中以黑体、加粗、下划线、斜体等方式显著标识的条款，请用户着重阅读。</div>
            <div>13.4用户登录卡小福平台即视为用户完全接受本协议，在登录之前请用户再次确认已知悉并完全理解本协议的全部内容。</div>
          </div>
        </div>
      </div>
    </div>
  </div>
</template>

<script>

export default {

  name: 'HelloWorld',
  data () {
    return {
      name: '',
      show: true,
      count: "",
    }
  },
  methods: {
    imgwarpclick () {

      this.$emit('Closethedeal');

    },

  },




}
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style scoped>
html,
body {
}
.useragreement {
  width: 100%;
  height: 100%;
  background: #fff;
  position: absolute;
  z-index: 1000;
  overflow-y: auto;
  overflow: auto;
  bottom: 0;
  left: 0;
}
.hellowwarp {
  width: 100%;
  height: 100%;
  position: absolute;
  /* background: #fff; */
  -moz-user-select: none;
  -khtml-user-select: none;
  user-select: none;
}
.heads {
  width: 100%;
  height: 1.2rem;
  border-bottom: 1px solid #f2f2f2;
  background: #fff;
  position: fixed;
  top: 0;
  left: 0;
}

.imgwarp {
  width: 1rem;
  height: 1.2rem;
  float: left;
}
.imgwarp img {
  width: 0.5rem;
  margin-top: 0.35rem;
  margin-left: 0.26rem;
}
.headtext {
  width: 3rem;
  margin: 0 auto;
  font-size: 0.45rem;
  text-align: center;
  line-height: 1.2rem;
}
/* .concent{
  width: 100%;
  height: 4.16rem;
  box-sizing: border-box;
  border-bottom: 1px solid #f2f2f2;
  background: #fff;
  text-align: center;
} */
.concent img {
  width: 1.6rem;
  height: 1.6rem;
  margin-top: 0.8rem;
}
.concent div {
  font-size: 0.373rem;
  color: #222;
  margin-top: 0.4rem;
}
.btnwarp {
  width: 100%;
  height: 2.69rem;
  background: #fff;
  overflow: hidden;
}
.btnwarpauto {
  width: 7.1rem;
  height: 1.1rem;
  margin: 0 auto;
  margin-top: 0.8rem;
}
.btnwarpauto div {
  width: 3.14rem;
  height: 1.1rem;
  box-sizing: border-box;
  border: 1px solid #222;
  float: left;
  border-radius: 5px;
  text-align: center;
  line-height: 1.1rem;
  font-size: 0.4rem;
}
.btnwarpauto .btnwarpautoright {
  float: right;
  background: #222;
  color: #fff;
}
.xieyi0 {
  width: 95%;
  margin: 0 auto;
  overflow: hidden;
  font-size: 0.373rem;
}
.xieyi0 h1 {
  font-size: 0.4rem;
  text-align: center;
  font-weight: bold;
  margin-top: 0.4rem;
}
.xieyi0 .text {
  margin-top: 0.2rem;
}
.xieyi0 div {
  margin-top: 0.1rem;
}
.concent {
  padding-top: 1.2rem;
  padding-bottom: 0.5rem;
}
</style>
